package com.jcca.web.common.constants;

import lombok.Getter;

/**
 * @description: 告警类型
 * @author: Lvyp
 * @create: 2024/04/18 15:14
 */
@Getter
public enum StationAlarmUniqueCodeEnum {

    /**
     * 车站ping告警
     */
    PING_STOP("PING告警",1,"车站采集器PING设备【%s】IP【%s】失败，请及时检查设备网络！",1),
    /**
     * 车站采集器与
     * 车站交换机通讯异常
     */
    PING_ROUT_STOP("车站采集器网络故障告警",3,"车站采集器与 %s IP【%s】通讯失败，请及时检查设备网络！",2),
    /**
     * 进程状态
     */
    PROCESS_STATUS_ERROR("进程丢失告警",1,"在%s时发现设备进程%s丢失，请及时处理！",2),
    /**
     * 进程CPU
     */
    PROCESS_CPU_THRESHOLD("进程CPU阈值告警",1,"进程%s在%s时采集到CPU使用率%s%%,设定值%s%%，进程CPU超阈值！，请及时处理！",2),
    /**
     * 进程内存
     */
    PROCESS_MEM_THRESHOLD("进程内存阈值告警",1,"进程%s在%s时采集到内存使用率%s,设定值%s，进程内存超阈值！，请及时处理！",2),
    /**
     * 端口状态
     */
    INTERFACES_STATUS("端口状态告警",1,"端口%s在%s时采集到状态异常，端口原始类型：%s,端口原始状态值:%s，请及时处理！",1),
    /**
     * 网卡状态
     */
    NET_STATUS_ERROR("网卡状态告警",1,"网卡%s在%s时断开，请及时处理！",1),

    /**
     * CPU使用率
     */
    CPU_RATE("CPU使用率超阈值告警",2,"设备：%s 在%s采集到CPU使用率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * cpu 上下限阈值
     */
    CPU_MAX_MIN_RATE("CPU使用率不在设定范围告警",2,"设备：%s 在%s采集到CPU使用率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * CPU一阶
     */
    CPU_ONE("CPU使用率超过设定一阶阈值告警",1,"设备：%s 在%s采集到CPU使用率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    CPU_TWO("CPU使用率超过设定二阶阈值告警",2,"设备：%s 在%s采集到CPU使用率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    CPU_THREE("CPU使用率超过设定三阶阈值告警",3,"设备：%s 在%s采集到CPU使用率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),

    /**
     * 内存使用率
     */
    MEM_RATE("内存使用率超阈值告警",2,"设备：%s 在%s采集到内存使用率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 内存 上下限阈值
     */
    MEM_MAX_MIN_RATE("内存使用率不在设定范围告警",2,"设备：%s 在%s采集到内存使用率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 内存一阶
     */
    MEM_ONE("内存使用率超过设定一阶阈值告警",1,"设备：%s 在%s采集到内存使用率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    MEM_TWO("内存使用率超过设定二阶阈值告警",2,"设备：%s 在%s采集到内存使用率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    MEM_THREE("内存使用率超过设定三阶阈值告警",3,"设备：%s 在%s采集到内存使用率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),

    /**
     * 磁盘使用率
     */
    DISK_RATE("磁盘使用率超阈值告警",2,"设备：%s 的磁盘：%s 在%s 采集到使用率为:%s %%,设定值:%s %%,超阈值！",1),
    /**
     * 磁盘 上下限阈值
     */
    DISK_MAX_MIN_RATE("磁盘使用率不在设定范围告警",2,"设备：%s 在%s采集到磁盘使用率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 磁盘一阶
     */
    DISK_ONE("磁盘使用率超过设定一阶阈值告警",1,"设备：%s 的磁盘：%s 在%s 采集到磁盘使用率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    DISK_TWO("磁盘使用率超过设定二阶阈值告警",2,"设备：%s 的磁盘：%s 在%s 采集到磁盘使用率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    DISK_THREE("磁盘使用率超过设定三阶阈值告警",3,"设备：%s 的磁盘：%s 在%s 采集到磁盘使用率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),


    /**
     * 运行时间
     */
    RUN_TIME("设备运行时间超阈值告警",2,"设备：%s 在%s采集到设备运行时长为:%s天,设定值:%s天,超阈值！",1),
    /**
     * 重启
     */
    RESTART("设备重启告警",2,"设备：%s 可能存在重启情况！",1),
    /**
     * 时间偏差
     */
    TIME_DEVIATION("设备时间偏差告警",2,"设备：%s 在%s采集到设备时间偏差为:%s 秒,设定值:%s 秒,超阈值！",1),





    /**
     * 流入丢包率
     */
    PACKET_LOSS_IN_RATE("流入丢包率超阈值告警",2,"设备：%s的%s端口，在%s采集到流入丢包率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流入丢包率 上下限阈值
     */
    PACKET_LOSS_IN_MAX_MIN_RATE("流入丢包率不在设定范围告警",2,"设备：%s的%s端口在%s采集到流入丢包率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流入丢包率分阶
     */
    PACKET_LOSS_IN_ONE("流入丢包率超过设定一阶阈值告警",1,"设备：%s的%s端口,在%s采集到流入丢包率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PACKET_LOSS_IN_TWO("流入丢包率超过设定二阶阈值告警",2,"设备：%s的%s端口,在%s采集到流入丢包率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PACKET_LOSS_IN_THREE("流入丢包率超过设定三阶阈值告警",3,"设备：%s的%s端口,在%s采集到流入丢包率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),

    /**
     * 流出丢包率
     */
    PACKET_LOSS_OUT_RATE("流出丢包率超阈值告警",2,"设备：%s的%s端口, 在%s采集到流出丢包率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流出丢包率 上下限阈值
     */
    PACKET_LOSS_OUT_MAX_MIN_RATE("流出丢包率不在设定范围告警",2,"设备：%s的%s端口, 在%s采集到流出丢包率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流出丢包率分阶
     */
    PACKET_LOSS_OUT_ONE("流出丢包率超过设定一阶阈值告警",1,"设备：%s的%s端口, 在%s采集到流出丢包率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PACKET_LOSS_OUT_TWO("流出丢包率超过设定二阶阈值告警",2,"设备：%s的%s端口, 在%s采集到流出丢包率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PACKET_LOSS_OUT_THREE("流出丢包率超过设定三阶阈值告警",3,"设备：%s的%s端口, 在%s采集到流出丢包率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),


    /**
     * 流入误码率
     */
    PACKET_ERROR_IN_RATE("流入误码率超阈值告警",2,"设备：%s的%s端口，在%s采集到流入误码率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流入误码率 上下限阈值
     */
    PACKET_ERROR_IN_MAX_MIN_RATE("流入误码率不在设定范围告警",2,"设备：%s的%s端口在%s采集到流入误码率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流入误码率分阶
     */
    PACKET_ERROR_IN_ONE("流入误码率超过设定一阶阈值告警",1,"设备：%s的%s端口,在%s采集到流入误码率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PACKET_ERROR_IN_TWO("流入误码率超过设定二阶阈值告警",2,"设备：%s的%s端口,在%s采集到流入误码率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PACKET_ERROR_IN_THREE("流入误码率超过设定三阶阈值告警",3,"设备：%s的%s端口,在%s采集到流入误码率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),

    /**
     * 流出误码率
     */
    PACKET_ERROR_OUT_RATE("流出误码率超阈值告警",2,"设备：%s的%s端口, 在%s采集到流出误码率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流出误码率 上下限阈值
     */
    PACKET_ERROR_OUT_MAX_MIN_RATE("流出误码率不在设定范围告警",2,"设备：%s的%s端口, 在%s采集到流出误码率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流出误码率分阶
     */
    PACKET_ERROR_OUT_ONE("流出误码率超过设定一阶阈值告警",1,"设备：%s的%s端口, 在%s采集到流出误码率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PACKET_ERROR_OUT_TWO("流出误码率超过设定二阶阈值告警",2,"设备：%s的%s端口, 在%s采集到流出误码率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PACKET_ERROR_OUT_THREE("流出误码率超过设定三阶阈值告警",3,"设备：%s的%s端口, 在%s采集到流出误码率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),


    /**
     * 流入率
     */
    PORT_IN_RATE("流入率超阈值告警",2,"设备：%s的%s端口，在%s采集到流入率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流入率 上下限阈值
     */
    PORT_IN_MAX_MIN_RATE("流入率不在设定范围告警",2,"设备：%s的%s端口在%s采集到流入率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流入率分阶
     */
    PORT_IN_ONE("流入率超过设定一阶阈值告警",1,"设备：%s的%s端口,在%s采集到流入率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PORT_IN_TWO("流入率超过设定二阶阈值告警",2,"设备：%s的%s端口,在%s采集到流入率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PORT_IN_THREE("流入率超过设定三阶阈值告警",3,"设备：%s的%s端口,在%s采集到流入率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),

    /**
     * 流出率
     */
    PORT_OUT_RATE("流出率超阈值告警",2,"设备：%s的%s端口, 在%s采集到流出率为:%s%%,设定值:%s%%,超阈值！",1),
    /**
     * 流出率 上下限阈值
     */
    PORT_OUT_MAX_MIN_RATE("流出率不在设定范围告警",2,"设备：%s的%s端口, 在%s采集到流出率为:%s%%,设定监测区间:【%s%%-%s%%】,不在设定范围内！",1),
    /**
     * 流出率分阶
     */
    PORT_OUT_ONE("流出率超过设定一阶阈值告警",1,"设备：%s的%s端口, 在%s采集到流出率为:%s%%,设定一阶阈值:%s%%,超一阶阈值！",1),
    PORT_OUT_TWO("流出率超过设定二阶阈值告警",2,"设备：%s的%s端口, 在%s采集到流出率为:%s%%,设定二阶阈值:%s%%,超二阶阈值！",1),
    PORT_OUT_THREE("流出率超过设定三阶阈值告警",3,"设备：%s的%s端口, 在%s采集到流出率为:%s%%,设定三阶阈值:%s%%,超三阶阈值！",1),


    ;

    private String title;
    private Integer alarmLevel;
    private String alarmTemp;
    /**
     * 告警分类
     * 硬件告警 1
     * 软件告警 2
     */
    private Integer alarmTye;

    StationAlarmUniqueCodeEnum(String title, Integer alarmLevel, String alarmTemp, Integer alarmTye) {
        this.title = title;
        this.alarmLevel = alarmLevel;
        this.alarmTemp = alarmTemp;
        this.alarmTye = alarmTye;
    }

}
